<template>
  <div id="people"></div>
</template>
<script>
import china from '@/libs/china'

export default {
  name: "people",
  data() {
    return {};
  },
  mounted() {
    this.initEchart;
  },
  methods: {
    initEchart() {
      var peopleEcharts = echarts.init(document.getElementById("people"));
      echarts.registerMap("china", china);


      // 数据
      var uploadedDataURL = "/asset/get/s/data-1528971808162-BkOXf61WX.json";

var geoGpsMap = [121.4648, 31.2891];
var t = 1;//流入流出控制
var r = 1;//右侧流入流出文字控制
var geoCoordMap = {
    "江苏": [118.8062, 31.9208],
    '黑龙江': [127.9688, 45.368],
    '内蒙古': [110.3467, 41.4899],
    "吉林": [125.8154, 44.2584],
    '北京市': [116.4551, 40.2539],
    "辽宁": [123.1238, 42.1216],
    "河北": [114.4995, 38.1006],
    "天津": [117.4219, 39.4189],
    "山西": [112.3352, 37.9413],
    "陕西": [109.1162, 34.2004],
    "甘肃": [103.5901, 36.3043],
    "宁夏": [106.3586, 38.1775],
    "青海": [101.4038, 36.8207],
    "新疆": [87.9236, 43.5883],
    "四川": [103.9526, 30.7617],
    "重庆": [108.384366, 30.439702],
    "山东": [117.1582, 36.8701],
    "河南": [113.4668, 34.6234],
    "安徽": [117.29, 32.0581],
    "湖北": [114.3896, 30.6628],
    "浙江": [119.5313, 29.8773],
    "福建": [119.4543, 25.9222],
    "江西": [116.0046, 28.6633],
    "湖南": [113.0823, 28.2568],
    "贵州": [106.6992, 26.7682],
    "云南": [102.9199, 25.4663],
    "广东": [113.12244, 23.009505],
    "广西": [108.479, 23.1152],
    "海南": [110.3893, 19.8516],
    '上海': [121.4648, 31.2891],
    "西藏": [91.11, 29.97],
};

var d1 = {
    '江苏':10041,
'黑龙江':4093,
'内蒙古':1157,
'吉林':4903,
'北京市':2667,
'辽宁':8331,
'河北':23727,
'天津':681,
'山西':5352,
'陕西':38,
'甘肃':77,
'宁夏':65,
'青海':10,
'新疆':22000,
'四川':309,
'重庆':77,
'山东':21666,
'河南':15717,
'安徽':15671,
'湖北':3714,
'浙江':3141,
'福建':955,
'江西':4978,
'湖南':778,
'贵州':33,
'云南':149,
'广东':1124,
'广西':125,
'海南':7,
'上海':2155,
'西藏':0

};

var d2 = {
     '江苏':159,
'黑龙江':5,
'内蒙古':54,
'吉林':10,
'北京市':0,
'辽宁':0,
'河北':1679,
'天津':1,
'山西':2698,
'陕西':1744,
'甘肃':362,
'宁夏':429,
'青海':122,
'新疆':731,
'四川':3925,
'重庆':1480,
'山东':79,
'河南':1017,
'安徽':208,
'湖北':1209,
'浙江':1418,
'福建':1237,
'江西':1004,
'湖南':1511,
'贵州':345,
'云南':1429,
'广东':2242,
'广西':2271,
'海南':59,
'上海':8,
   '西藏':0
};

var d3 = {
    '江苏':11788,
'黑龙江':1944,
'内蒙古':2954,
'吉林':3482,
'北京市':1808,
'辽宁':5488,
'河北':27035,
'天津':2270,
'山西':13623,
'陕西':4221,
'甘肃':754,
'宁夏':1783,
'青海':91,
'新疆':1907,
'四川':4905,
'重庆':1420,
'山东':39781,
'河南':16154,
'安徽':7914,
'湖北':6802,
'浙江':5812,
'福建':3345,
'江西':4996,
'湖南':5627,
'贵州':1504,
'云南':2725,
'广东':6339,
'广西':1009,
'海南':0,
'上海':1988,

'西藏':0

};

var d4 = {
     '江苏':10041,
'黑龙江':4093,
'内蒙古':1157,
'吉林':4903,
'北京市':2667,
'辽宁':8331,
'河北':23727,
'天津':681,
'山西':5352,
'陕西':38,
'甘肃':77,
'宁夏':65,
'青海':10,
'新疆':193,
'四川':309,
'重庆':77,
'山东':21666,
'河南':15717,
'安徽':15671,
'湖北':3714,
'浙江':3141,
'福建':955,
'江西':4978,
'湖南':778,
'贵州':33,
'云南':149,
'广东':1124,
'广西':125,
'海南':7,
'上海':2155,
'西藏':0
};

var d5 = {
   '江苏':159,
'黑龙江':5,
'内蒙古':54,
'吉林':10,
'北京市':0,
'辽宁':0,
'河北':1679,
'天津':1,
'山西':2698,
'陕西':1744,
'甘肃':362,
'宁夏':429,
'青海':122,
'新疆':731,
'四川':3925,
'重庆':1480,
'山东':79,
'河南':1017,
'安徽':208,
'湖北':1209,
'浙江':1418,
'福建':1237,
'江西':1004,
'湖南':1511,
'贵州':345,
'云南':1429,
'广东':2242,
'广西':2271,
'海南':59,
'上海':8,
'西藏':0

};

var d6 = {
      '江苏':11788,
'黑龙江':1944,
'内蒙古':2954,
'吉林':3482,
'北京市':1808,
'辽宁':5488,
'河北':27035,
'天津':2270,
'山西':13623,
'陕西':4221,
'甘肃':754,
'宁夏':1783,
'青海':91,
'新疆':1907,
'四川':4905,
'重庆':1420,
'山东':39781,
'河南':16154,
'安徽':7914,
'湖北':6802,
'浙江':5812,
'福建':3345,
'江西':4996,
'湖南':5627,
'贵州':1504,
'云南':2725,
'广东':6339,
'广西':1009,
'海南':0,
'上海':1988,
'西藏':0
};

var colors = 
    ["#1DE9B6", "#EEDD78", "#32C5E9", "#FFDB5C", "#37A2DA", "#04B9FF"];
var colorIndex = 0;


      peopleEcharts.setOption({
        backgroundColor: "#080a20",
        title: {
          text: "模拟迁徙",
          subtext: "数据纯属虚构",
          left: "left",
          textStyle: {
            color: "#fff",
          },
        },
        tooltip: {
          trigger: "item",
        },
        legend: {
          orient: "vertical",
          top: "bottom",
          left: "right",
          data: ["北京 Top10", "上海 Top10", "广州 Top10"],
          textStyle: {
            color: "#fff",
          },
          selectedMode: "single",
        },
        geo: { // 阿里云地图
          map: "china", // 对应全局引入的数据名
          show:true,
          label: {
            emphasis: {
              show: false,
            },
          },
          roam: true,
          itemStyle: {
            normal: {
              areaColor: "#132937",
              borderColor: "#0692a4",
            },
            emphasis: {
              areaColor: "#0b1c2d",
            },
          },
        },
        series: series,
      });
    },
  },
};
</script>

<style scoped>
#people{
    width: 100%;
    height: 1000px;
}
</style>